/*
  Blink
  Αυτός ο κώδικας, ανάβει το led για ένα δευτερόλεπτο και το σβήνει για ένα δευτερόλεπτο

	Είναι έτοιμος κώδικας παρμένος από το arduino.cc
 */


// Η συνάρτηση setup τρέχει όταν πατάτε το reset ή όταν παίρνει ρεύμα το arduino
void setup() {
  // Το τερματικό 13 να είναι έξοδος
  pinMode(13, OUTPUT);
}

// Η συνάρτηση loop επαναλαμβάνει τον κώδικα που έχει μέσα της ΓΙΑ ΠΑΝΤΑ
void loop() {
  digitalWrite(13, HIGH);   // Δώσε τάση στο 13
  delay(1000);              // Περίμενε 1000ms = 1δευτερόλεπτο
  digitalWrite(13, LOW);    // Μηδένησε την τάση στο 13
  delay(1000);              // Περίμενε 1 δευτερόλεπτο
}
